stm32LLD/timer/src/timer.c
    return status;
}

////////////////////////////////////////////////////////////////////////////////
/*!
* @brief        De-Initialize timer
*
* @param[in]    tim_inst    - Timer instance
* @return       status      - Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
timer_status_t timer_deinit(const timer_inst_t tim_inst)
{
    timer_status_t status = eTIMER_OK;

    TIMER_ASSERT( tim_inst < eTIM_INST_NUM_OF );

    if ( tim_inst < eTIM_INST_NUM_OF )
    {
        if ( true == g_tim_inst[tim_inst].is_init )
        {
            // De-initilize timer
            HAL_TIM_Base_DeInit( &g_tim_inst[tim_inst].handle );

            // Disable timer clock
            timer_disable_clock( g_tim_inst[tim_inst].handle.Instance );

            // Init success
            if ( eTIMER_OK == status )
            {
                g_tim_inst[tim_inst].is_init = false;
            }
        }
    }
    else
    {
        status = eTIMER_ERROR;
    }

    return status;
}

////////////////////////////////////////////////////////////////////////////////
/*!
* @brief        Get Timer initialization flag
*
* @param[in]    tim_inst    - Timer instance
* @param[out]   p_is_init   - Pointer to init flag
* @return       status      - Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
timer_status_t timer_is_init(const timer_inst_t tim_inst, bool * const p_is_init)
{
    timer_status_t status = eTIMER_OK;

    TIMER_ASSERT( tim_inst < eTIM_INST_NUM_OF );
    TIMER_ASSERT( NULL != p_is_init );

    if  (   ( tim_inst < eTIM_INST_NUM_OF )
        &&  ( NULL != p_is_init ))
    {
        *p_is_init = g_tim_inst[tim_inst].is_init;
    }
    else
    {
        status = eTIMER_ERROR;
    }

    return status;
}

////////////////////////////////////////////////////////////////////////////////
/*!
* @brief        Start timer
*
* @param[in]    tim_inst    - Timer instance
* @return       status      - Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
timer_status_t timer_start(const timer_inst_t tim_inst)
{
    timer_status_t status = eTIMER_OK;

    TIMER_ASSERT( tim_inst < eTIM_INST_NUM_OF );
    TIMER_ASSERT( true == g_tim_inst[tim_inst].is_init );

    if  (   ( tim_inst < eTIM_INST_NUM_OF )
        &&  ( true == g_tim_inst[tim_inst].is_init ))
    {
        if ( HAL_OK != HAL_TIM_Base_Start( &g_tim_inst[tim_inst].handle ))
        {
            status = eTIMER_ERROR;
        }
    }
    else
    {
        status = eTIMER_ERROR;
    }

    return status;
}

////////////////////////////////////////////////////////////////////////////////
/*!
* @brief        Stop timer
*
* @param[in]    tim_inst    - Timer instance
* @return       status      - Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
timer_status_t timer_stop(const timer_inst_t tim_inst)
{
    timer_status_t status = eTIMER_OK;

    TIMER_ASSERT( tim_inst < eTIM_INST_NUM_OF );
    TIMER_ASSERT( true == g_tim_inst[tim_inst].is_init );

    if  (   ( tim_inst < eTIM_INST_NUM_OF )
        &&  ( true == g_tim_inst[tim_inst].is_init ))
    {
        if ( HAL_OK != HAL_TIM_Base_Stop( &g_tim_inst[tim_inst].handle ))
        {
            status = eTIMER_ERROR;
        }
    }
    else
    {
        status = eTIMER_ERROR;
    }

    return status;
}

////////////////////////////////////////////////////////////////////////////////
/*!
* @brief        Set timer counter
*
* @param[in]    tim_inst    - Timer instance
* @param[in]    counter     - Timer counter value
* @return       status      - Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
timer_status_t timer_cnt_set(const timer_inst_t tim_inst, const uint32_t counter)
{
    timer_status_t status = eTIMER_OK;

    TIMER_ASSERT( tim_inst < eTIM_INST_NUM_OF );
    TIMER_ASSERT( true == g_tim_inst[tim_inst].is_init );

    if  (   ( tim_inst < eTIM_INST_NUM_OF )
        &&  ( true == g_tim_inst[tim_inst].is_init ))
    {
        __HAL_TIM_SET_COUNTER( &g_tim_inst[tim_inst].handle, counter );
    }
    else
    {
        status = eTIMER_ERROR;
    }

    return status;
}

////////////////////////////////////////////////////////////////////////////////
/*!
* @brief        Set timer counter to 0
*
* @param[in]    tim_inst    - Timer instance
* @return       status      - Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
timer_status_t timer_cnt_reset(const timer_inst_t tim_inst)
{
    timer_status_t status = eTIMER_OK;

    status = timer_cnt_set( tim_inst, 0U );

    return status;
}

////////////////////////////////////////////////////////////////////////////////
/*!
* @brief        Get timer counter
*
* @param[in]    tim_inst    - Timer instance
* @param[out]   p_counter   - Pointer to counter value
* @return       status      - Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
timer_status_t timer_cnt_get(const timer_inst_t tim_inst, uint32_t * const p_counter)
{
    timer_status_t status = eTIMER_OK;

    TIMER_ASSERT( tim_inst < eTIM_INST_NUM_OF );
    TIMER_ASSERT( true == g_tim_inst[tim_inst].is_init );
    TIMER_ASSERT( NULL != p_counter );

    if  (   ( tim_inst < eTIM_INST_NUM_OF )
        &&  ( true == g_tim_inst[tim_inst].is_init )
        &&  ( NULL != p_counter ))
    {
        *p_counter = __HAL_TIM_GET_COUNTER( &g_tim_inst[tim_inst].handle );
    }
    else
    {
        status = eTIMER_ERROR;
    }

    return status;
}




static TIM_HandleTypeDef gh_tim1 = {0};



#include "config/pin_mapper.h"

static void timer_1_init_gpio(void)
{
    GPIO_InitTypeDef GPIO_InitStruct = {0};

    // Enable clocks
    __HAL_RCC_GPIOC_CLK_ENABLE();
    __HAL_RCC_GPIOB_CLK_ENABLE();
    __HAL_RCC_GPIOA_CLK_ENABLE();

    // Timer 1 Channel 1 - Positive PWM
    GPIO_InitStruct.Pin         = TIM1_CH1__PIN;
    GPIO_InitStruct.Mode        = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull        = GPIO_NOPULL;
    GPIO_InitStruct.Speed       = GPIO_SPEED_FREQ_HIGH;
    GPIO_InitStruct.Alternate   = TIM1_CH1__AF;
    HAL_GPIO_Init( TIM1_CH1__PORT, &GPIO_InitStruct );

    // Timer 1 Channel 1 - Negative PWM
    GPIO_InitStruct.Pin         = TIM1_CH1N__PIN;
    GPIO_InitStruct.Mode        = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull        = GPIO_NOPULL;
    GPIO_InitStruct.Speed       = GPIO_SPEED_FREQ_HIGH;
    GPIO_InitStruct.Alternate   = TIM1_CH1N__AF;
    HAL_GPIO_Init( TIM1_CH1N__PORT, &GPIO_InitStruct );

