stm32LLD/timer/src/timer.c
    // Timer 1 Channel 2 - Positive PWM
    GPIO_InitStruct.Pin         = TIM1_CH2__PIN;
    GPIO_InitStruct.Mode        = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull        = GPIO_NOPULL;
    GPIO_InitStruct.Speed       = GPIO_SPEED_FREQ_HIGH;
    GPIO_InitStruct.Alternate   = TIM1_CH2__AF;
    HAL_GPIO_Init( TIM1_CH2__PORT, &GPIO_InitStruct );

    // Timer 1 Channel 2 - Negative PWM
    GPIO_InitStruct.Pin         = TIM1_CH2N__PIN;
    GPIO_InitStruct.Mode        = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull        = GPIO_NOPULL;
    GPIO_InitStruct.Speed       = GPIO_SPEED_FREQ_HIGH;
    GPIO_InitStruct.Alternate   = TIM1_CH2N__AF;
    HAL_GPIO_Init( TIM1_CH2N__PORT, &GPIO_InitStruct );

    // Timer 1 Channel 3 - Positive PWM
    GPIO_InitStruct.Pin         = TIM1_CH3__PIN;
    GPIO_InitStruct.Mode        = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull        = GPIO_NOPULL;
    GPIO_InitStruct.Speed       = GPIO_SPEED_FREQ_HIGH;
    GPIO_InitStruct.Alternate   = TIM1_CH3__AF;
    HAL_GPIO_Init( TIM1_CH3__PORT, &GPIO_InitStruct );

    // Timer 1 Channel 3 - Negative PWM
    GPIO_InitStruct.Pin         = TIM1_CH3N__PIN;
    GPIO_InitStruct.Mode        = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull        = GPIO_NOPULL;
    GPIO_InitStruct.Speed       = GPIO_SPEED_FREQ_HIGH;
    GPIO_InitStruct.Alternate   = TIM1_CH3N__AF;
    HAL_GPIO_Init( TIM1_CH3N__PORT, &GPIO_InitStruct );
}




timer_status_t timer_1_init(const timer_1_cfg_t * const p_cfg)
{
    timer_status_t status = eTIMER_OK;

    TIM_ClockConfigTypeDef          sClockSourceConfig      = {0};
    TIM_MasterConfigTypeDef         sMasterConfig           = {0};
    TIM_OC_InitTypeDef              sConfigOC               = {0};
    TIM_BreakDeadTimeConfigTypeDef  sBreakDeadTimeConfig    = {0};

    // Init Timer PWM gpios
    timer_1_init_gpio();

    // Enable timer clock
    __HAL_RCC_TIM1_CLK_ENABLE();


    // Input clock is 150 MHz
    // Frequency times 2 as it is up/down counter
    const uint32_t period = (uint32_t)( 150e6 / ( 2 * p_cfg->freq ));

    gh_tim1.Instance                  = TIM1;
    gh_tim1.Init.Prescaler            = 0;
    gh_tim1.Init.CounterMode          = TIM_COUNTERMODE_CENTERALIGNED1;
    gh_tim1.Init.Period               = period;
    gh_tim1.Init.ClockDivision        = TIM_CLOCKDIVISION_DIV1;
    gh_tim1.Init.RepetitionCounter    = 0;
    gh_tim1.Init.AutoReloadPreload    = TIM_AUTORELOAD_PRELOAD_DISABLE;

    if ( HAL_OK != HAL_TIM_Base_Init( &gh_tim1 ))
    {
        status = eTIMER_ERROR;
    }


    sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;

    if ( HAL_OK != HAL_TIM_ConfigClockSource( &gh_tim1, &sClockSourceConfig ))
    {
        status = eTIMER_ERROR;
    }


    if ( HAL_OK != HAL_TIM_PWM_Init( &gh_tim1 ))
    {
        status = eTIMER_ERROR;
    }


    // TODO: This is important for ADC triggering
    sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
    sMasterConfig.MasterOutputTrigger2 = TIM_TRGO2_RESET;
    sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
    if (HAL_TIMEx_MasterConfigSynchronization(&gh_tim1, &sMasterConfig) != HAL_OK)
    {
        status = eTIMER_ERROR;
    }


    sConfigOC.OCMode        = TIM_OCMODE_PWM1;
    sConfigOC.Pulse         = 0;
    sConfigOC.OCPolarity    = TIM_OCPOLARITY_HIGH;
    sConfigOC.OCNPolarity   = TIM_OCNPOLARITY_HIGH;
    sConfigOC.OCFastMode    = TIM_OCFAST_DISABLE;
    sConfigOC.OCIdleState   = TIM_OCIDLESTATE_RESET;
    sConfigOC.OCNIdleState  = TIM_OCNIDLESTATE_RESET;

    if ( HAL_OK != HAL_TIM_PWM_ConfigChannel( &gh_tim1, &sConfigOC, TIM_CHANNEL_1 ))
    {
        status = eTIMER_ERROR;
    }

    if ( HAL_OK != HAL_TIM_PWM_ConfigChannel( &gh_tim1, &sConfigOC, TIM_CHANNEL_2 ))
    {
        status = eTIMER_ERROR;
    }

    if ( HAL_OK != HAL_TIM_PWM_ConfigChannel( &gh_tim1, &sConfigOC, TIM_CHANNEL_3 ))
    {
      status = eTIMER_ERROR;
    }


    // Calculate deadtime
    // p_cfg->deadtime [us] * timer_freq [MHz]
    const uint32_t deadtime = (uint32_t) ( p_cfg->deadtime * 150e6 );

    sBreakDeadTimeConfig.OffStateRunMode    = TIM_OSSR_DISABLE;
    sBreakDeadTimeConfig.OffStateIDLEMode   = TIM_OSSI_DISABLE;
    sBreakDeadTimeConfig.LockLevel          = TIM_LOCKLEVEL_OFF;
    sBreakDeadTimeConfig.DeadTime           = deadtime;
    sBreakDeadTimeConfig.BreakState         = TIM_BREAK_DISABLE;
    sBreakDeadTimeConfig.BreakPolarity      = TIM_BREAKPOLARITY_HIGH;
    sBreakDeadTimeConfig.BreakFilter        = 0;
    sBreakDeadTimeConfig.BreakAFMode        = TIM_BREAK_AFMODE_INPUT;
    sBreakDeadTimeConfig.Break2State        = TIM_BREAK2_DISABLE;
    sBreakDeadTimeConfig.Break2Polarity     = TIM_BREAK2POLARITY_HIGH;
    sBreakDeadTimeConfig.Break2Filter       = 0;
    sBreakDeadTimeConfig.Break2AFMode       = TIM_BREAK_AFMODE_INPUT;
    sBreakDeadTimeConfig.AutomaticOutput    = TIM_AUTOMATICOUTPUT_DISABLE;


    if ( HAL_OK != HAL_TIMEx_ConfigBreakDeadTime( &gh_tim1, &sBreakDeadTimeConfig ))
    {
        status = eTIMER_ERROR;
    }

    //HAL_TIM_Base_Start
    HAL_TIM_Base_Start( &gh_tim1 );

    HAL_TIM_PWM_Start( &gh_tim1, TIM_CHANNEL_1 );
    HAL_TIM_PWM_Start( &gh_tim1, TIM_CHANNEL_2 );
    HAL_TIM_PWM_Start( &gh_tim1, TIM_CHANNEL_3 );
    HAL_TIMEx_PWMN_Start( &gh_tim1, TIM_CHANNEL_1 );
    HAL_TIMEx_PWMN_Start( &gh_tim1, TIM_CHANNEL_2 );
    HAL_TIMEx_PWMN_Start( &gh_tim1, TIM_CHANNEL_3 );

    __HAL_TIM_SET_COMPARE( &gh_tim1, TIM_CHANNEL_1, 0x100 );
    __HAL_TIM_SET_COMPARE( &gh_tim1, TIM_CHANNEL_2, 0x200 );
    __HAL_TIM_SET_COMPARE( &gh_tim1, TIM_CHANNEL_3, 0x300 );

    return status;
}

timer_status_t timer_1_set_pwm(const float32_t duty_u, const float32_t duty_v, const float32_t duty_w)
{
    timer_status_t status = eTIMER_OK;

    (void) duty_u;
    (void) duty_v;
    (void) duty_w;

    return status;
}



////////////////////////////////////////////////////////////////////////////////
/**
* @} <!-- END GROUP -->
*/
////////////////////////////////////////////////////////////////////////////////
